<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>Do we know how to make a good software ?</h1>
<h2>(Ovaj članak je prebačen sa ranijeg posterous blog sistema)
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/08/moje-prve-igrarije-sa-titanium-appceleratorom.html">Previous</a>
&nbsp; 
<a href="../../../index.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/08/mac-os-x-open-width-macvim.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Eksterni monitor za macbook</h3>
<div class='post_info'>
<span class='post_time'>August 14 2011,  3:28 AM</span>
<span class='author'>&nbsp;by Saša Vranić</span>
</div>
</div>
<div class='post_body'><p>Na mom macbook-u postoji kod mini-dvi port odmah do usb konektora. Taj port nam omogućava da koristimo eksterni monitor.</p>
<p>Sve &scaron;to treba da se nabavi je konverter mini-dvi to vga ili dvi. Ja sam taj konektor prona&scaron;ao na eBay-u za nekih 5 dolara.</p>
<p><!--more--></p>
<p><strong>Kako napraviti pode&scaron;enja?</strong></p>
<p>Mac me odu&scaron;evio (opet) sa svojom filozofijom, naravno pozitivno, tako da sam eksterni monitor spojio bez ikakvih frustracija. Govorim frustracija zato &scaron;to sam se godinama mučio sam nVidia i ATI kontrol panelima i pode&scaron;enjima za dual monitore itd...</p>
<p>Ovdje je to apple napravio jako elegantno.</p>
<p>Nakon &scaron;to smo spojili eksterni monitor putem konvertera odmah vidimo da smo dobili i na monitoru i na lcd-u macbook-a identičan ekran. Stvar radi, odmah za početak :)</p>
<p>Eh... idemo dalje. Prvo &scaron;to treba da uradimo je, otići u system preferences te odabrati <strong>Monitors</strong>. Nakon &scaron;to smo odabrali odmah nam se otvaraju dva prozora sa pode&scaron;enjima</p>
<ul>
<li><div class='p_embed p_image_embed'>
<img src='../../../image/2011/08/30402095-color_lcd_disp.png'>
</div>
<div class='p_embed p_image_embed'>
<img src='../../../image/2011/08/30402110-vga_disp.png'>
</div>
VGA display - to su nam pode&scaron;enja za eksterni monitor, jer sam ga spojio putem VGA kabla</li>
<li>LCD display - to su nam pode&scaron;enja samog lcd displeya na macbook-u</li>
</ul>
<p>Na VGA display podesimo željenu rezoluciju, ja sam stavio na najveću jer mi to monitor podržava, na LCD display-u također vratim na najveću rezoluciju. Zatim na VGA display postavkama idemo na karticu <strong>Arrangement</strong> te isljučimo opciju <strong>Mirror displays</strong>, ba&scaron; kao na sljedećoj slici:</p>
<p><div class='p_embed p_image_embed'>
<img src='../../../image/2011/08/30402225-vga_arrangement.png'>
</div>
Ostao je samo jo&scaron; jedan korak do finalnog pode&scaron;enja... Naime, jo&scaron; nam je LCD display primarni display, te jo&scaron; sve menije gledamo na samom macbook-u. Sve &scaron;to treba da uradimo je da zgrabimo i prevučemo mali bijeli kvadratić u ovim prezentacijama monitora (plavim) i prevučemo ga na na&scaron; VGA display, ba&scaron; kao &scaron;to sam to ja uradio i prikazao na ovoj slici:</p>
<p><div class='p_embed p_image_embed'>
<img src='../../../image/2011/08/30402279-vga_arrangement_02.png'>
</div>
</p>
<p>Također, ja sam uključio opciju <strong>Show displays in menu bar</strong>, te sada na glavnom meniju uvijek imam dostupne opcije za baratanje sa monitorima</p>
<p><div class='p_embed p_image_embed'>
<img src='../../../image/2011/08/30402322-monitor_dock.png'>
</div>
<strong>Dodatna testiranja</strong></p>
<p>Testirao sam sada situaciju da iskopčam ovaj konverter za VGA kabl (recimo da nosim macbook), nakon isključenja na LCD monitoru se automatski vrate sve postavke menija itd... uključujući i ispravnu rezoluciju.</p>
<p>Kada vratim koverter nazad, za par sekundi se izvr&scaron;i automatska detekcija, te se menij opet vrati na VGA display itd...</p>
<p>Jako jako dobro odrađeno.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>macosx, user</div>
</div>
<div class='post_responses'>
<h4>Pregleda 193, komentara: 2</h4>(Status na dan 07.04.2013 prema statistici posterous blog sistema)<hr/>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Sep 20 2011, 12:39 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Vjeruj da sam te juče htio pitati kako si ovo podesio.</div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Sep 20 2011, 12:40 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Ovo su definitivno članci za <a href="http://do-we-know-how.bring.out.ba" rel="nofollow">http://do-we-know-how.bring.out.ba</a><p>Ima li posterous mogućnost da uradiš pomjeranje članka ? Ako ima, de živ bio , pomjeri ga.</p></div>
</li>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'knowhowbringout'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
