<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>Do we know how to make a good software ?</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/12/f18-development.html">Previous</a>
&nbsp; 
<a href="../../../index.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/10/knowhowerp-par-trikova-video-prvi.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Kako je nastao F18</h3>
<div class='post_info'>
<span class='post_time'>December 13 2011,  7:51 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p><a href="http://redmine.bring.out.ba/projects/f18">F18</a> je interesantan projekat po mnogo čemu.</p>
<p>Ako ni&scaron;ta drugo, on je projekat koji je započeo kao moj&nbsp;<a href="http://redmine.bring.out.ba/issues/24716">san</a>&nbsp;:)</p>
<p>Međutim, neću se ovdje baviti svojim snovima, nego tehničkim aspektima njegovog razvoja.&nbsp;</p>
<p>F18 ima za cilj portirati <a href="https://github.com/bringout-fmk">FMK</a>. FMK je pisan u programskom jeziku <a href="http://en.wikipedia.org/wiki/Clipper_(programming_language)">Clipper</a>.&nbsp;Njegova platforma za razvoj je <a href="http://en.wikipedia.org/wiki/DOS">DOS</a>.</p>
<p>To FMK u dana&scaron;nji vakat čini u potpunosti tehnički <a href="http://www.bring.out.ba/fmk-ipak-ne-radi">inferiornim proizvodom</a>.</p>
<p><!--more-->Međutim, "problem" je &scaron;to je to proizvod koji na&scaron;i korisnici i dan danas svakodnevno koriste. Na&scaron;a korisnička baza se značajno umanjila, ali se i danas većina na&scaron;eg posla "vrti" oko FMK.</p>
<p>U proteklih 10-tak godina vi&scaron;e puta je započeto portiranje FMK - u smjeru Delphi-ja, u smjeru .NET-a, u smjeru harbour-a. Svaki poku&scaron;aj zavr&scaron;io je neuspjehom.</p>
<p><a href="http://www.bring.out.ba/sta-sa-fmk">knowhow ERP</a>&nbsp;je &nbsp;započeo svoj život kao rezultat frustracije na&scaron;ih najvećih - najzahtjevnijih klijenata. Za njih je, očekivano, FMK postao "usko grlo".</p>
<p>On radi svakodnevne poslove, ali ne ide naprijed. On radi, ali njegovi tehnički limiti, posebno na intenzivnijem radu u mreži i većoj količini podataka, svako malo prave probleme. Ovi problemi se na Clipper/DOS platformi jednostavno ne može rije&scaron;iti.</p>
<p>Fmk je u istoriji "bring.out" je često bio klasično "pastorče". Ni sam ne znam koliko puta sam rekao:</p>
<blockquote class="posterous_short_quote">
<p>FMK je istorija, FMK je postao glavobolja. Moramo se okrenuti u drugom smijeru. Moramo se &scaron;to prije rije&scaron;iti FMK ...</p>
</blockquote>
<p>Ali, svaki put kada bi plan o eutanaziji FMK izgledao kao jedina dobra i moguća odluka za napredak firme, pojavio bi se neki novi zahtjev klijenata koji bi nas "osvjestio" da to nije jednostavno učiniti.&nbsp;</p>
<p>"Ubijanje" FMK bez odgovarajućeg zamjenskog rje&scaron;enja značilo bi kraj "bring.out", a ne samo kraj "FMK" projekta.</p>
<p>"knowhow ERP" je pokrenut upravo sa misijom zamjenskog rje&scaron;enja, bring.out ERP rje&scaron;enja nove generacije.</p>
<p>Vođeni brojnim neuspje&scaron;nim poku&scaron;ajima migracije FMK, "knowhow ERP" je baziran na sljedećim stavkama:</p>
<ol>
<li>Ostaviti FMK po strani.&nbsp;</li>
<li>Odabrati neki "open source" projekat koji je nabliži na&scaron;em cilju</li>
</ol>
<p>Pri tome se od "FMK" mogu "krasti" algoritmi i iskustvo skupljeno iz predhodnih 17 godina, ali ni slučajno ne uzimati kao pravac razvoja portiranje "FMK".&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Migracija "legacy" aplikacije</strong></span></p>
<p>Kada smo do&scaron;li do opearcija migracije podataka iz FMK u "knowhow ERP", utrvdili smo da ćemo to &nbsp;najbrže i najkvalitetnije uraditi sa "open source" nasljednikom Clipper-a - <a href="http://www.harbour-project.org/">harbour-om</a>:</p>
<ol>
<li>harbour ima prvoklasnu podr&scaron;ku za rat sa&nbsp;<a href="http://en.wikipedia.org/wiki/DBase">DBF</a>&nbsp;tabelama FMK</li>
<li>radi se o nama poznatom programskom jeziku</li>
<li>"open source" developerski alat</li>
<li>bilo nam je poznato da postoji podr&scaron;ka za PostgreSQL koji koristi knowhow ERP</li>
</ol>
<p>Migracija je kompleksan proces. Developeri je uvijek podcjenjuju aktivnosti migracije kao neki međuposao. U praksi, migracija najče&scaron;će biva zahtjevan i ozbiljan posao.</p>
<p>Odabir harobur-a za realizaciju migracije FMK =&gt; knowhowERP se pokazao dobrom odlukom.&nbsp;</p>
<p>Rad sa PostgreSQL (nadalje pg) podacima u harbour-u bio je iznad očekivanja. Brzina pristupa, jednostavnost programiranja prema&scaron;ili su na&scaron;a očekivanja. Prebacivanje 5-6 hiljada zapisa pg baze u dbf tabelu trajalo je sekundu-dvije. Na osnovu tih iskustava se rodila ideja o <a href="http://redmine.bring.out.ba/issues/24716">semaforima</a>.&nbsp;</p>
<p>Nakon izrade prvog prototipa F18, ponovo je pitanje portiranja FMK aktuelizirano. Ali ovaj put sa drugim ciljevima i dometom.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ograničen domet</strong></span></p>
<p>F18 je u startu zami&scaron;ljen kao projekat ograničenog dometa. Njegovi glavni ciljevi su bili:</p>
<ol>
<li>Izbaciti FMK "iz igre" u kratkom roku</li>
<li>Ubaciti tehnologije od kojih nas neće boliti glava.</li>
<li>rije&scaron;iti se ovisnosti o Windows/DOS platformi</li>
<li>Obezbjediti "smooth" prelazak za korisnike kojima je FMK u funkcionalnom smislu dovoljno dobar.</li>
</ol>
<p>Znači, sa stanovi&scaron;ta postojećih korisnika FMK, cilj je doći do proizvoda koji će korisnici doživjeti kao FMK koji radi brže(*) i ima "veći" ekran(**). U većini, F18 će za njih biti dobri stari FMK na koji su navikli, koji mogu "žmireći" koristiti.</p>
<p>Nemate pojma koliko je ovo "žmireći" bitan atribut :).</p>
<p>Međutim, kada smo počeli ozbiljnije "kopati" po kodu, pojavilo se niz developerskih dilema. Na mnogim mjestima FMK kod je klasični developerski "nightmare".</p>
<p>Na svakom mjestu gdje je trebalo implementirati semafore(***) stari kod se morao razbiti na cjeline. Prvobitna namjera da se stari kod minimalno dira su postale diskutabilne.</p>
<p>To minimalno diranje je značajno usporilo proces portiranja. Pa &scaron;ta onda učiniti ? Po četvrti put reći: Ni&scaron;ta od portiranja ?! Ne, ovaj put ne.</p>
<p>Portiranje je, bez obzira na te&scaron;koće, pokazalo da je F18 za "bring.out" i postojeće FMK korisnike prava stvar. &nbsp;</p>
<p>Za većinu postojećih FMK korisnika F18 je proizvod koji će ih dobro služiti narednih 10 godina.</p>
<p>Zato treba imati na umio da F18 nije privremeno rje&scaron;enje. On ne realizira ciljeve koji su postavljeni pod "knowhow ERP" - obezbjediti bring.out ERP proizvod nove generacije. Međutim, on je veoma značajan da se do tog cilja dođe, te je sa razlogom stavljen kao podprojekat "knowhow ERP".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Manje lo&scaron;e rje&scaron;enje</strong></span></p>
<p>Na <a href="https://github.com/knowhow/F18_knowhow">F18 github accountu</a>&nbsp;sam naveo:</p>
<blockquote class="posterous_short_quote">
<p>F18 - simple accounting for Bosnians</p>
</blockquote>
<p>Da li bi ovakav proizvod neko mimo na&scaron;ih postojećih korisnika kupio ? Mislim da bi. Bosansko ERP trži&scaron;te je preplavljeno smećem. Uvoznim i domaćim. Zato je FMK opstao ovolike godine. Zato &scaron;to se među bosanskim korisnicima ERP software-a vi&scaron;e vodi priča o tome koje je rje&scaron;enje manje lo&scaron;e, nego koje je rje&scaron;enje vi&scaron;e dobro.</p>
<p>Zato bi bilo interesantno ponuditi rje&scaron;enje koje može biti veoma jefitno za tekuću eksploataciju, koje se može koristiti kao servis. F18 to može biti.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>"može" =&gt; "jeste", kako ?</strong></span></p>
<p>Za "bring.out" F18 predstavlja rje&scaron;enje koje&nbsp;<strong>može</strong>&nbsp;značajno olak&scaron;ati proces podr&scaron;ke, tekuće održavanje rje&scaron;enja. Ako se to postigne, onda se može pričati o nižim cijenama za klijente.</p>
<p>E kvaka je u ovom "može". Iza može, uvijek slijedi "ali i ne mora".</p>
<p>U narednom članku ću sa stanovi&scaron;ta razvoja F18 objasniti koji smo mi put odabrali da se ova mogućnost pretvori u realnost.</p>
<p>---</p>
<p>(*) svaki korisnik radi sa lokalnim dbf tabelama</p>
<p>(**) povećana rezolucija sa 80x25 =&gt; 140x40</p>
<p>(***) podaci se &scaron;alju na PostgreSQL server</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, f18_knowhow</div>
</div>
<div class='post_responses'>
<h4>Pregleda 223, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici dotadašnjeg posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'knowhowbringout'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
